Scenario: Let's say we're working in a marketing department at Ozo Coffee (Links to an external site.), a local Boulder coffee shop that roasts some killer beans. They're looking to expand their roastery, and they're looking at new areas in which they can begin to market their online coffee ordering store to. They'd like to start with some billboards in specific cities to get the word out.

Ozo is a relatively new company. We don't know much about our target audience outside of Boulder. Luckily, Mintel, one of the leading Market research companies, just did a report on who drinks premium coffee.

Ozo is unique because we actually roast organic coffee, a pretty rare quality for coffee. Your boss tells you that your ads are going to use this key differentiator as the unique selling proposition for Ozo.

Let's start by getting a list of possible cities. Your boss is indifferent, and says that we need to start with the "largest cities." After some reading, you think that metro areas make more sense than specific cities, because metro areas tend to have more data on them, and people in the suburbs of cities also like coffee. You go to the Census website, and look for a list of MSAs. You find this page, and poke around (Links to an external site.), download an excel file with all of the MSAs. You notice that each MSA has a CBSA. CBSAs are codes that corresponds directly to a specific geofenced area in the US.  Fetch the data file directly from https://s3.amazonaws.com/vargo.aprd6342/data/msas.csv (Links to an external site.)

There are three columns in the data, the CBSA code, the name of the area, and the 2017 estimated population for that area. Get this CSV loaded into a dataframe.

Now, let's use CensusReporter, a very cool census data organization and visualization tool, and take a look at one of the metro areas, New York-Newark-Jersey City, NY-NJ-PA Metro Area (Links to an external site.). Inspect the charts. Think about what data would you extract from these charts to get your answers.

Let's take a look at the url: https://censusreporter.org/profiles/31000US35620-new-york-newark-jersey-city-ny-nj-pa-metro-area/ (Links to an external site.)

From the url above, you can see that each metro area has a code. It's intentional that what follows the "US" in the URL is the CBSA. So if we look at this part of the URL: 31000US35620, the CBSA is 35620.

Now it's time to get the data we need for the CBSA codes we have. Let's go back to our example MSA. Explore the page. Find the chart(s) that have the data you want (that match the three parameters from earlier).

In [0]:
import pandas as pd
import numpy as np
import requests
import json

In [0]:
DATA_URL = 'https://s3.amazonaws.com/vargo.aprd6342/data/msas.csv'
df = pd.read_csv(DATA_URL)

Change CBSA column to include US Code

In [0]:
df['CBSA2'] = '31000US'+ df['CBSA'].astype(str)

Set the new code to the index

In [0]:
df = df.set_index('CBSA2')

Drop the old CBSA codes (now that it has CBSA + USA codes as index)

In [0]:
df.drop('CBSA',axis=1,inplace=True)

Create an array of tables needed for census data

In [0]:
tableids = ['B01001', 'B03002', 'B19001']

In [0]:
tableidstring = ",".join(tableids)

create a URL for getting data crom censusreporter with table that we want to compare

In [0]:
requesturl = 'https://api.censusreporter.org/1.0/data/show/latest?table_ids=%s&geo_ids=310|01000US' % tableidstring

In [0]:
requesturl

'https://api.censusreporter.org/1.0/data/show/latest?table_ids=B01001,B03002,B19001&geo_ids=310|01000US'

In [0]:
loadedjson = requests.get(requesturl)

In [0]:
parsedjson = json.loads(loadedjson.text)

create another data frame with the income, age, and hispanic population information

In [0]:
newdf = pd.DataFrame({ '50 - 59k': { id_: data['B19001']['estimate']['B19001011'] for id_, data in parsedjson['data'].items() }})
newdf['60 - 75k'] = pd.DataFrame({ '60 - 75k': { id_: data['B19001']['estimate']['B19001012'] for id_, data in parsedjson['data'].items() }})
newdf['18 and 19 years'] = pd.DataFrame({ '18 and 19 years': { id_: data['B01001']['estimate']['B01001007'] for id_, data in parsedjson['data'].items() }})
newdf['20 years'] = pd.DataFrame({ '20 years': { id_: data['B01001']['estimate']['B01001008'] for id_, data in parsedjson['data'].items() }})
newdf['21 years'] = pd.DataFrame({ '21 years': { id_: data['B01001']['estimate']['B01001009'] for id_, data in parsedjson['data'].items() }})
newdf['22 to 24 years'] = pd.DataFrame({ '22 to 24 years': { id_: data['B01001']['estimate']['B01001010'] for id_, data in parsedjson['data'].items() }})
newdf['25 to 29 years'] = pd.DataFrame({ '25 to 29 years': { id_: data['B01001']['estimate']['B01001011'] for id_, data in parsedjson['data'].items() }})
newdf['30 to 34 years'] = pd.DataFrame({ '30 to 34 years': { id_: data['B01001']['estimate']['B01001012'] for id_, data in parsedjson['data'].items() }})
newdf['35 to 39 years'] = pd.DataFrame({ '35 to 39 years': { id_: data['B01001']['estimate']['B01001013'] for id_, data in parsedjson['data'].items() }})
newdf['40 to 44 years'] = pd.DataFrame({ '40 to 44 years': { id_: data['B01001']['estimate']['B01001014'] for id_, data in parsedjson['data'].items() }})
newdf['Hispanic'] = pd.DataFrame({ 'Hispanic or Latino': { id_: data['B03002']['estimate']['B03002012'] for id_, data in parsedjson['data'].items() }})
newdf['total 50-75k'] = newdf['50 - 59k'] + newdf['60 - 75k']
newdf['Total 18 - 34'] = newdf['18 and 19 years'] + newdf['20 years'] + newdf['22 to 24 years'] + newdf['25 to 29 years'] + newdf['30 to 34 years'] + newdf['21 years']
newdf['Total 35 - 44'] = newdf['35 to 39 years'] + newdf['40 to 44 years']

merge the two dataframes on the index

In [0]:
df_index = pd.merge(df, newdf, right_index=True, left_index=True)

In [0]:
df_index

                                           NAME  ...  Average Score
31000US10180                        Abilene, TX  ...       0.009380
31000US10420                          Akron, OH  ...       0.028692
31000US10500                         Albany, GA  ...       0.005641
31000US10540                         Albany, OR  ...       0.005294
31000US10580        Albany-Schenectady-Troy, NY  ...       0.037070
...                                         ...  ...            ...
31000US49420                         Yakima, WA  ...       0.016128
31000US49620                   York-Hanover, PA  ...       0.019475
31000US49660  Youngstown-Warren-Boardman, OH-PA  ...       0.022332
31000US49700                      Yuba City, CA  ...       0.009251
31000US49740                           Yuma, AZ  ...       0.015542

[382 rows x 20 columns]

Create columns to answer these questions: 
What city has the highest count of the audience you chose for parameter?
What city has the highest count of the audience you chose for parameter?
What city has the highest count of the audience you chose for parameter?
What city has the highest mean percentage across all three categories?

In [0]:
df_index['income percent'] = df_index['total 50-75k'] / 1050888
df_index['age percent'] = df_index['Total 18 - 34'] / 2392291
df_index['Hispanic percent'] = df_index['Hispanic'] / 5972751
df_index['Average Score'] = (df_index['income percent'] + df_index['age percent'] + df_index['Hispanic percent']) / 3

In [0]:
dfincome = df_index.sort_values('total 50-75k', ascending=False)
dfincome.head()

                                               NAME  ...  Total 35 - 44
31000US35620  New York-Newark-Jersey City, NY-NJ-PA  ...      1304691.0
31000US31080     Los Angeles-Long Beach-Anaheim, CA  ...       904643.0
31000US16980     Chicago-Naperville-Elgin, IL-IN-WI  ...       632170.0
31000US19100        Dallas-Fort Worth-Arlington, TX  ...       496618.0
31000US26420   Houston-The Woodlands-Sugar Land, TX  ...       471347.0

[5 rows x 16 columns]

In [0]:
dfage = df_index.sort_values('Total 18 - 34', ascending=False)
dfage.head()

                                               NAME  ...  Total 35 - 44
31000US35620  New York-Newark-Jersey City, NY-NJ-PA  ...      1304691.0
31000US31080     Los Angeles-Long Beach-Anaheim, CA  ...       904643.0
31000US16980     Chicago-Naperville-Elgin, IL-IN-WI  ...       632170.0
31000US19100        Dallas-Fort Worth-Arlington, TX  ...       496618.0
31000US26420   Houston-The Woodlands-Sugar Land, TX  ...       471347.0

[5 rows x 16 columns]

In [0]:
dfhispanic = df_index.sort_values('Hispanic', ascending=False)
dfhispanic.head()

                                                   NAME  ...  Total 35 - 44
31000US31080         Los Angeles-Long Beach-Anaheim, CA  ...       904643.0
31000US35620      New York-Newark-Jersey City, NY-NJ-PA  ...      1304691.0
31000US33100  Miami-Fort Lauderdale-West Palm Beach, FL  ...       396313.0
31000US26420       Houston-The Woodlands-Sugar Land, TX  ...       471347.0
31000US40140       Riverside-San Bernardino-Ontario, CA  ...       283562.0

[5 rows x 16 columns]

In [0]:
dfscore = df_index.sort_values('Average Score', ascending=False)
dfscore.head()

                                               NAME  ...  Average Score
31000US35620  New York-Newark-Jersey City, NY-NJ-PA  ...       0.938099
31000US31080     Los Angeles-Long Beach-Anaheim, CA  ...       0.795259
31000US16980     Chicago-Naperville-Elgin, IL-IN-WI  ...       0.460290
31000US19100        Dallas-Fort Worth-Arlington, TX  ...       0.374644
31000US26420   Houston-The Woodlands-Sugar Land, TX  ...       0.374490

[5 rows x 20 columns]

Answers to questions: 
1. The highest count for income 50 - 75k is the New York Metro Area
2. The highest count for age 18-34 is the New York Metro Area
3. The highest count for Hispanic population is the Los Angeles Metro Area
4. The highest percentage across all three is the New York Metro Area